jamesblashill/pocket-watch/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS is not set
# CONFIG_SPIRAM_RODATA is not set
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_PM_ENABLE=y
CONFIG_PM_PROFILING=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
# CONFIG_PM_POWER_DOWN_TAGMEM_IN_LIGHT_SLEEP is not set
# CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP is not set
# CONFIG_PM_RESTORE_CACHE_TAGMEM_AFTER_LIGHT_SLEEP is not set
# ESP32-S3's USB-Serial-JTAG peripheral doesn't survive automatic light
# sleep (no SOC_USB_SERIAL_JTAG_SUPPORT_LIGHT_SLEEP) - without this, the
# monitor host loses the device the moment the screen-off power policy lets
# the chip nap, and needs a physical unplug/replug to re-enumerate. This
# holds a light-sleep PM lock for as long as a USB Serial/JTAG host is
# actually attached, and releases it the instant nothing's listening - so it
# only costs sleep while monitoring, not on battery in the field.
CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION=y
# A panic (crash/exception) currently prints its backtrace to the console
# and reboots (CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT) - fine if a monitor is
# attached, but if it happens on battery with nothing listening, that
# backtrace is gone forever and a crash is indistinguishable from a hang.
# Flash coredump persists it in the `coredump` partition (partitions.csv)
# so `idf.py coredump-info`/`espcoredump.py` can decode it after the fact,
# whether or not anyone was watching when it happened.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=2000000
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_BROOKESIA_ENABLE_AI_FRAMEWORK=n
CONFIG_ESP_BROOKESIA_GUI_ENABLE_ANIM_PLAYER=n
CONFIG_ESP_BROOKESIA_ENABLE_SERVICES=n
CONFIG_ESP_BROOKESIA_SYSTEMS_ENABLE_SPEAKER=n
CONFIG_BOOST_MATH_ENABLED=n
CONFIG_BOOST_SERIALIZATION_ENABLED=n
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OBJ_STYLE_CACHE=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
# CONFIG_SPIRAM_XIP_FROM_PSRAM is not set
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_LVGL_ADAPTER_ENABLE_FPS_STATS=y